In [1]:
import pandas as pd
import numpy as np
s1 = pd.Series(range(10), index = range(10))
s2 = pd.Series(range(5), index = range(5))

In [6]:
s1

0    0
1    1
2    2
3    3
4    4
5    5
6    6
7    7
8    8
9    9
dtype: int64

In [7]:
s2

0    0
1    1
2    2
3    3
4    4
dtype: int64

In [8]:
s1+s2

0    0.0
1    2.0
2    4.0
3    6.0
4    8.0
5    NaN
6    NaN
7    NaN
8    NaN
9    NaN
dtype: float64

In [11]:
df1 = pd.DataFrame(np.ones((2,2)),index=range(2),columns=["a","b"])
df1

     a    b
0  1.0  1.0
1  1.0  1.0

In [14]:
df2 = pd.DataFrame(np.ones((3,3)),index=[0,1,2],columns=["a","b","c"])
df2

     a    b    c
0  1.0  1.0  1.0
1  1.0  1.0  1.0
2  1.0  1.0  1.0

In [15]:
df2 - df1

     a    b   c
0  0.0  0.0 NaN
1  0.0  0.0 NaN
2  NaN  NaN NaN

In [16]:
s1.add(s2,fill_value = -1)

0    0.0
1    2.0
2    4.0
3    6.0
4    8.0
5    4.0
6    5.0
7    6.0
8    7.0
9    8.0
dtype: float64

In [24]:
s1.add(s2,fill_value = 0.)

0    0.0
1    2.0
2    4.0
3    6.0
4    8.0
5    5.0
6    6.0
7    7.0
8    8.0
9    9.0
dtype: float64

In [30]:
df1.add(df2,fill_value=0)

     a    b    c
0  2.0  2.0  1.0
1  2.0  2.0  1.0
2  1.0  1.0  1.0

In [32]:
df1.sub(df2,fill_value=0)

     a    b    c
0  0.0  0.0 -1.0
1  0.0  0.0 -1.0
2 -1.0 -1.0 -1.0

In [37]:
df = pd.DataFrame(np.random.randn(4,4),columns=["a","b","c","d"])
df

          a         b         c         d
0  0.788125  1.493324 -0.592775 -0.545138
1  1.425520  2.060266  0.616885  0.194066
2  0.855534 -1.103468 -0.737065 -0.034648
3  0.599009 -1.309338  1.599414 -0.115887

In [38]:
df.apply(lambda x:np.max(x))

a    1.425520
b    2.060266
c    1.599414
d    0.194066
dtype: float64

In [41]:
df.apply(lambda x:np.max(x),axis=1)

0    1.493324
1    2.060266
2    0.855534
3    1.599414
dtype: float64

In [43]:
df.apply(lambda x: "%.2f" % x)

TypeError: cannot convert the series to <class 'float'>

In [42]:
df.applymap(lambda x: "%.2f" % x)

      a      b      c      d
0  0.79   1.49  -0.59  -0.55
1  1.43   2.06   0.62   0.19
2  0.86  -1.10  -0.74  -0.03
3  0.60  -1.31   1.60  -0.12

In [5]:
df = pd.DataFrame(np.random.randn(3, 5), 
                   index=np.random.randint(3, size=3),
                   columns=np.random.randint(5, size=5))
df

          4         2         2         3         2
2 -0.250698  0.645157 -0.239754  0.874454  0.241429
1 -0.149568 -0.250452 -0.040797 -1.502825  0.580440
1 -1.470254  0.779906 -0.720498 -0.315904 -0.757795

In [7]:
df.sort_values(by=4,ascending=False)

          4         2         2         3         2
1 -0.149568 -0.250452 -0.040797 -1.502825  0.580440
2 -0.250698  0.645157 -0.239754  0.874454  0.241429
1 -1.470254  0.779906 -0.720498 -0.315904 -0.757795

In [11]:
df = pd.DataFrame([np.random.randn(3),[1.,2.,np.nan],[np.nan,4,np.nan],[1.,2.,3.]])
df

          0         1         2
0 -1.172955  0.765056  0.216846
1  1.000000  2.000000       NaN
2       NaN  4.000000       NaN
3  1.000000  2.000000  3.000000

In [12]:
df.isnull()

       0      1      2
0  False  False  False
1  False  False   True
2   True  False   True
3  False  False  False

In [13]:
df.dropna()

          0         1         2
0 -1.172955  0.765056  0.216846
3  1.000000  2.000000  3.000000

In [15]:
df.dropna(axis=1)

          1
0  0.765056
1  2.000000
2  4.000000
3  2.000000

In [16]:
df.fillna(-100)

            0         1           2
0   -1.172955  0.765056    0.216846
1    1.000000  2.000000 -100.000000
2 -100.000000  4.000000 -100.000000
3    1.000000  2.000000    3.000000